function sumArray(numbers) {
  // Повертаємо результат виклику методу 'reduce' на вхідному масиві 'numbers'.
  return numbers.reduce(
    // 'reduce' приймає функцію (callback) і початкове значення.
    // 'acc' (акумулятор) загальна сума, накопичена на даний момент.
    // 'current'поточний елемент масиву, що обробляється.
    // Стрілкова функція повертає нове значення акумулятора (поточна сума + поточний елемент).
    (acc, current) => acc + current, 
    // 0 це початкове значення для акумулятора ('acc') перед початком підрахунку.
    0
  );
}
console.log(sumArray([1, 2, 3, 4, 5])); // 15
console.log(sumArray([10, 20, 30]));    // 60

// Експорт функції 'sumArray', щоб її можна було імпортувати в інших файлах.
module.exports = sumArray;
