// Оголошення функції findMax, яка приймає масив 'numbers'.
function findMax(numbers) {
  // Повертаємо результат роботи
  return numbers.reduce(
    // 'reduce' приймає функцію (callback) і початкове значення.
    // 'max'максимальне значення, знайдене до поточного моменту (акумулятор).
    // 'current'поточний елемент масиву, що розглядається.
    // Стрілкова функція порівнює поточний елемент ('current') з максимальним ('max').
    // (current > max ? current : max) тернарний оператор:
    // ЯКЩО 'current' > 'max', то повернути 'current' (це нове максимальне значення).
    // ІНАКШЕ, повернути 'max' (максимальне значення не змінилося).
    (max, current) => current > max ? current : max, 
    // numbers[0] – це початкове значення для 'max'.
    // припускаємо, що перший елемент масиву є максимальним,
    // і 'reduce' почне порівнювати його з *другим* елементом.
    numbers[0]
  );
}
console.log(findMax([3, 5, 7, 2, 8])); // 8
console.log(findMax([10, 20, 5, 30])); // 30
module.exports = findMax;
